tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>Maxim Integrated</vendor>                                       <!-- device vendor name -->
  <vendorID>Maxim</vendorID>                                        <!-- device vendor short name -->
  <name>max32620</name>                                        <!-- name of part-->
  <series>ARMCM4</series>                                         <!-- device series the device belongs to -->
  <version>1.1</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>The MAX32620/1 device family is designed for wearable and portable medical and fitness applications. The devices contain an ARM Cortex-M4 processor with FPU, execute up to 96MHz and include a 10-bit ADC and a versatile set of on-chip peripherals. </description>
  <licenseText>                                                   <!-- this license text will appear in header file. \n force line breaks -->
    Copyright (C) 2017 Maxim Integrated Products, Inc., All Rights Reserved.\n
    \n
    Permission is hereby granted, free of charge, to any person obtaining a\n
    copy of this software and associated documentation files (the "Software"),\n
    to deal in the Software without restriction, including without limitation\n
    the rights to use, copy, modify, merge, publish, distribute, sublicense,\n
    and/or sell copies of the Software, and to permit persons to whom the\n
    Software is furnished to do so, subject to the following conditions:\n
    \n
    The above copyright notice and this permission notice shall be included\n
    in all copies or substantial portions of the Software.\n
    \n
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n
    OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n
    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n
    IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES\n
    \n
    OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n
    ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n
    OTHER DEALINGS IN THE SOFTWARE.\n
    \n
    Except as contained in this notice, the name of Maxim Integrated\n
    Products, Inc. shall not be used except as stated in the Maxim Integrated\n
    Products, Inc. Branding Policy.\n
    \n
    The mere transfer of this software does not imply any licenses\n
    of trade secrets, proprietary technology, copyrights, patents,\n
    trademarks, maskwork rights, or any other form of intellectual\n
    property whatsoever. Maxim Integrated Products, Inc. retains all\n
    ownership rights.
  </licenseText>
  <cpu>                                                           <!-- details about the cpu embedded in the device -->
    <name>CM4</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
  and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <peripherals>

    <!-- SYSMAN:CLKMAN -->

    <peripheral>
      <name>CLKMAN</name>
      <version>1.0</version>
      <description>System Clock Manager</description>
      <groupName>System Clock Manager</groupName>
      <baseAddress>0x40000400</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLKMAN</name>
        <value>0</value>
        <description>Clock Management IRQ</description>
      </interrupt>
      <registers>

        <!-- CLK_CONFIG: System Clock Configuration -->
        <register>
          <name>CLK_CONFIG</name>
          <description>System Clock Configuration</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>crypto_enable</name>
              <description>Cryptographic (TPU) Relaxation Oscillator Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>crypto_stability_count</name>
              <description>Crypto Oscillator Stability Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CLK_CTRL: System Clock Controls -->
        <register>
          <name>CLK_CTRL</name>
          <description>System Clock Controls</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>system_source_select</name>
              <description>System Clock Source Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_clock_enable</name>
              <description>USB Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_clock_select</name>
              <description>USB Clock Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>crypto_clock_enable</name>
              <description>Crypto Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtos_mode</name>
              <description>Enable RTOS Mode for SysTick Timers</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu_dynamic_clock</name>
              <description>Enable CPU Dynamic Clock Gating</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wdt0_clock_enable</name>
              <description>Watchdog 0 Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wdt0_clock_select</name>
              <description>Watchdog 0 Clock Source Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wdt1_clock_enable</name>
              <description>Watchdog 1 Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wdt1_clock_select</name>
              <description>Watchdog 1 Clock Source Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_clock_enable</name>
              <description>ADC Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTFL: Interrupt Flags -->
        <register>
          <name>INTFL</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>crypto_stable</name>
              <description>Crypto Oscillator Stable Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>sys_ro_stable</name>
              <description>System Oscillator Stable Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- INTEN: Interrupt Enable/Disable Controls -->
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable/Disable Controls</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>crypto_stable</name>
              <description>Crypto Oscillator Stable Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_ro_stable</name>
              <description>System Oscillator Stable Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TRIM_CALC: Trim Calculation Controls -->
        <register>
          <name>TRIM_CALC</name>
          <description>Trim Calculation Controls</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>trim_clk_sel</name>
              <description>Trim Clock Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_calc_start</name>
              <description>Start Trim Calculation</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_calc_completed</name>
              <description>Trim Calculation Completed</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>trim_enable</name>
              <description>Trim Logic Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_calc_results</name>
              <description>Trim Calculation Results</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- I2C_TIMER_CTRL: I2C Timer Control -->
        <register>
          <name>I2C_TIMER_CTRL</name>
          <description>I2C Timer Control</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>i2c_1ms_timer_en</name>
              <description>I2C 1ms Timer Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CM4_START_CLK_EN0: CM4 Start Clock on Interrupt Enable 0 -->
        <register>
          <name>CM4_START_CLK_EN0</name>
          <description>CM4 Start Clock on Interrupt Enable 0</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ints</name>
              <description>Interrupt Sources 0-31</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CM4_START_CLK_EN1: CM4 Start Clock on Interrupt Enable 1 -->
        <register>
          <name>CM4_START_CLK_EN1</name>
          <description>CM4 Start Clock on Interrupt Enable 1</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ints</name>
              <description>Interrupt Sources 32-63</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CM4_START_CLK_EN2: CM4 Start Clock on Interrupt Enable 2 -->
        <register>
          <name>CM4_START_CLK_EN2</name>
          <description>CM4 Start Clock on Interrupt Enable 2</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ints</name>
              <description>Interrupt Sources 95-64</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

