tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- SYS_CLK_CTRL_9_I2CM: Control Settings for CLK9 - Source Clock for All I2C Masters -->
        <register>
          <name>SYS_CLK_CTRL_9_I2CM</name>
          <description>Control Settings for CLK9 - Source Clock for All I2C Masters</description>
          <addressOffset>0x0064</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>i2cm_clk_scale</name>
              <description>Control Settings for CLK9 - Source Clock for All I2C Masters</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_10_I2CS: Control Settings for CLK10 - Source Clock for I2C Slave -->
        <register>
          <name>SYS_CLK_CTRL_10_I2CS</name>
          <description>Control Settings for CLK10 - Source Clock for I2C Slave</description>
          <addressOffset>0x0068</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>i2cs_clk_scale</name>
              <description>Control Settings for CLK10 - Source Clock for I2C Slave</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_11_SPI0: Control Settings for CLK11 - SPI Master 0 -->
        <register>
          <name>SYS_CLK_CTRL_11_SPI0</name>
          <description>Control Settings for CLK11 - SPI Master 0</description>
          <addressOffset>0x006C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spi0_clk_scale</name>
              <description>Control Settings for CLK11 - SPI Master 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_12_SPI1: Control Settings for CLK12 - SPI Master 1 -->
        <register>
          <name>SYS_CLK_CTRL_12_SPI1</name>
          <description>Control Settings for CLK12 - SPI Master 1</description>
          <addressOffset>0x0070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spi1_clk_scale</name>
              <description>Control Settings for CLK12 - SPI Master 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_13_SPI2: Control Settings for CLK13 - SPI Master 2 -->
        <register>
          <name>SYS_CLK_CTRL_13_SPI2</name>
          <description>Control Settings for CLK13 - SPI Master 2</description>
          <addressOffset>0x0074</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spi2_clk_scale</name>
              <description>Control Settings for CLK13 - SPI Master 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_14_SPIB: Control Settings for CLK14 - SPI Bridge Clock -->
        <register>
          <name>SYS_CLK_CTRL_14_SPIB</name>
          <description>Control Settings for CLK14 - SPI Bridge Clock</description>
          <addressOffset>0x0078</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spib_clk_scale</name>
              <description>Control Settings for CLK14 - SPI Bridge Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_15_OWM: Control Settings for CLK15 - 1-Wire Master Clock -->
        <register>
          <name>SYS_CLK_CTRL_15_OWM</name>
          <description>Control Settings for CLK15 - 1-Wire Master Clock</description>
          <addressOffset>0x007C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>owm_clk_scale</name>
              <description>Control Settings for CLK15 - 1-Wire Master Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CRYPT_CLK_CTRL_0_AES: Control Settings for Crypto Clock 0 - AES -->
        <register>
          <name>CRYPT_CLK_CTRL_0_AES</name>
          <description>Control Settings for Crypto Clock 0 - AES</description>
          <addressOffset>0x0100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>aes_clk_scale</name>
              <description>Control Settings for Crypto Clock 0 - AES</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CRYPT_CLK_CTRL_1_MAA: Control Settings for Crypto Clock 1 - MAA -->
        <register>
          <name>CRYPT_CLK_CTRL_1_MAA</name>
          <description>Control Settings for Crypto Clock 1 - MAA</description>
          <addressOffset>0x0104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>maa_clk_scale</name>
              <description>Control Settings for Crypto Clock 1 - MAA</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CRYPT_CLK_CTRL_2_PRNG: Control Settings for Crypto Clock 2 - PRNG -->
        <register>
          <name>CRYPT_CLK_CTRL_2_PRNG</name>
          <description>Control Settings for Crypto Clock 2 - PRNG</description>
          <addressOffset>0x0108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>prng_clk_scale</name>
              <description>Control Settings for Crypto Clock 2 - PRNG</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

