tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
      </registers>
    </peripheral>


    <!-- CRC:CRC -->

    <peripheral>
      <name>CRC</name>
      <description>CRC-16/CRC-32 Engine</description>
      <!-- <groupName>CRC</groupName> -->
      <baseAddress>0x40006000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- RESEED: CRC-16/CRC-32 Reseed Controls -->
        <register>
          <name>RESEED</name>
          <description>CRC-16/CRC-32 Reseed Controls</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>crc16</name>
              <description>Reseed CRC16 Generator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>crc32</name>
              <description>Reseed CRC32 Generator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- SEED16: Reseed Value for CRC-16 Calculations -->
        <register>
          <name>SEED16</name>
          <description>Reseed Value for CRC-16 Calculations</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SEED32: Reseed Value for CRC-32 Calculations -->
        <register>
          <name>SEED32</name>
          <description>Reseed Value for CRC-32 Calculations</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
        </register>

      </registers>
    </peripheral>


    <!-- TPU:TPU -->

    <peripheral>
      <name>TPU</name>
      <description>Trust Protection Unit (TPU)</description>
      <!-- <groupName>TPU</groupName> -->
      <baseAddress>0x40007000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- PRNG_USER_ENTROPY: PRNG User Entropy Value -->
        <register>
          <name>PRNG_USER_ENTROPY</name>
          <description>PRNG User Entropy Value</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
        </register>

        <!-- PRNG_RND_NUM: PRNG Random Number Output -->
        <register>
          <name>PRNG_RND_NUM</name>
          <description>PRNG Random Number Output</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
        </register>

      </registers>
    </peripheral>


    <!-- TPU:TPU_TSR -->

    <peripheral>
      <name>TPU_TSR</name>
      <description>Trust Protection Unit (TPU)</description>
      <!-- <groupName>TPU</groupName> -->
      <baseAddress>0x40007C00</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- SKS0: TPU Secure Key Storage Register 0 (Cleared on Tamper Detect) -->
        <register>
          <name>SKS0</name>
          <description>TPU Secure Key Storage Register 0 (Cleared on Tamper Detect)</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SKS1: TPU Secure Key Storage Register 1 (Cleared on Tamper Detect) -->
        <register>
          <name>SKS1</name>
          <description>TPU Secure Key Storage Register 1 (Cleared on Tamper Detect)</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SKS2: TPU Secure Key Storage Register 2 (Cleared on Tamper Detect) -->
        <register>
          <name>SKS2</name>
          <description>TPU Secure Key Storage Register 2 (Cleared on Tamper Detect)</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SKS3: TPU Secure Key Storage Register 3 (Cleared on Tamper Detect) -->
        <register>
          <name>SKS3</name>
          <description>TPU Secure Key Storage Register 3 (Cleared on Tamper Detect)</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
        </register>

      </registers>
    </peripheral>


    <!-- AES:AES -->

    <peripheral>
      <name>AES</name>
      <description>AES Cryptographic Engine</description>
      <!-- <groupName>AES</groupName> -->
      <baseAddress>0x40007400</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>9</value>
        <description>AES IRQ</description>
      </interrupt>

      <registers>
        <!-- CTRL: AES Control and Status -->
        <register>
          <name>CTRL</name>
          <description>AES Control and Status</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>start</name>
              <description>AES Start/Busy</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>crypt_mode</name>
              <description>AES Encrypt/Decrypt Mode</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCRYPT_MODE</name>
                  <description>Perform AES encryption operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECRYPT_MODE</name>
                  <description>Perform AES decryption operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>exp_key_mode</name>
              <description>AES Expanded Key Mode</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALC_NEW_EXP_KEY</name>
                  <description>Calculate new expanded key for this operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_LAST_EXP_KEY</name>
                  <description>Use expanded key calculated by the last operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>key_size</name>
              <description>AES Key Size Select</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_SIZE_128</name>
                  <description>Use 128-bit AES key size.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_SIZE_192</name>
                  <description>Use 192-bit AES key size.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_SIZE_256</name>
                  <description>Use 256-bit AES key size.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>inten</name>
              <description>AES Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>intfl</name>
              <description>AES Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- ERASE_ALL: Write to Trigger AES Memory Erase -->
        <register>
          <name>ERASE_ALL</name>
          <description>Write to Trigger AES Memory Erase</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
        </register>
