tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
      </registers>
    </peripheral>


    <!-- WDT:WDT1 -->

    <peripheral derivedFrom="WDT0">
      <name>WDT1</name>
      <groupName>Watch Dog Timers</groupName>
      <baseAddress>0x40009000</baseAddress>
      <interrupt>
        <name>WDT1</name>
        <value>13</value>
        <description>Watch Dog Timer 1 IRQ</description>
      </interrupt>
      <interrupt>
        <name>WDT1_PRE_WIN</name>
        <value>14</value>
        <description>Watch Dog Timer 1 Pre-Window IRQ</description>
      </interrupt>
    </peripheral>


    <!-- GPIO:GPIO -->

    <peripheral>
      <name>GPIO</name>
      <description>General Purpose I/O Ports (GPIO)</description>
      <groupName>IO</groupName>
      <baseAddress>0x4000A000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO0</name>
        <value>15</value>
        <description>GPIO Port 0 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO1</name>
        <value>16</value>
        <description>GPIO Port 1 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO2</name>
        <value>17</value>
        <description>GPIO Port 2 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO3</name>
        <value>18</value>
        <description>GPIO Port 3 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO4</name>
        <value>19</value>
        <description>GPIO Port 4 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO5</name>
        <value>20</value>
        <description>GPIO Port 5 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO6</name>
        <value>21</value>
        <description>GPIO Port 6 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO7</name>
        <value>50</value>
        <description>GPIO Port 7 IRQ</description>
      </interrupt>
      <interrupt>
        <name>GPIO8</name>
        <value>51</value>
        <description>GPIO Port 8 IRQ</description>
      </interrupt>
      <registers>
        <!-- RST_MODE_P0: Port P0 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P0</name>
          <description>Port P0 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P0.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P0.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P0.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P0.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P0.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P0.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P0.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P0.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P1: Port P1 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P1</name>
          <description>Port P1 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P1.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P1.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P1.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P1.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P1.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P1.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P1.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P1.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P2: Port P2 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P2</name>
          <description>Port P2 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P2.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P2.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P2.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P2.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P2.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P2.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P2.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P2.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P3: Port P3 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P3</name>
          <description>Port P3 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P3.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P3.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P3.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P3.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P3.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P3.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P3.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P3.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P4: Port P4 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P4</name>
          <description>Port P4 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P4.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P4.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P4.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P4.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P4.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P4.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P4.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P4.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P5: Port P5 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P5</name>
          <description>Port P5 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P5.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P5.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P5.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P5.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P5.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P5.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P5.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P5.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RST_MODE_P6: Port P6 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P6</name>
          <description>Port P6 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P0: Port P0 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P0</name>
          <description>Port P0 Free for GPIO Operation Flags</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P0.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P0.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P0.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P0.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P0.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P0.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P0.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P0.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

