tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- FREE_P1: Port P1 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P1</name>
          <description>Port P1 Free for GPIO Operation Flags</description>
          <addressOffset>0x0044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P1.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P1.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P1.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P1.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P1.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P1.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P1.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P1.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P2: Port P2 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P2</name>
          <description>Port P2 Free for GPIO Operation Flags</description>
          <addressOffset>0x0048</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P2.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P2.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P2.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P2.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P2.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P2.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P2.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P2.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P3: Port P3 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P3</name>
          <description>Port P3 Free for GPIO Operation Flags</description>
          <addressOffset>0x004C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P3.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P3.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P3.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P3.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P3.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P3.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P3.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P3.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P4: Port P4 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P4</name>
          <description>Port P4 Free for GPIO Operation Flags</description>
          <addressOffset>0x0050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P4.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P4.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P4.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P4.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P4.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P4.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P4.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P4.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P5: Port P5 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P5</name>
          <description>Port P5 Free for GPIO Operation Flags</description>
          <addressOffset>0x0054</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P5.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P5.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P5.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P5.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P5.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P5.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P5.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P5.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P6: Port P6 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P6</name>
          <description>Port P6 Free for GPIO Operation Flags</description>
          <addressOffset>0x0058</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

