tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- INT_MODE_P4: Port P4 Interrupt Detection Mode -->
        <register>
          <name>INT_MODE_P4</name>
          <description>Port P4 Interrupt Detection Mode</description>
          <addressOffset>0x01D0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P4.0 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P4.1 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P4.2 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P4.3 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P4.4 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P4.5 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P4.6 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P4.7 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INT_MODE_P5: Port P5 Interrupt Detection Mode -->
        <register>
          <name>INT_MODE_P5</name>
          <description>Port P5 Interrupt Detection Mode</description>
          <addressOffset>0x01D4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P5.0 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P5.1 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P5.2 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P5.3 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P5.4 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P5.5 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P5.6 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P5.7 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INT_MODE_P6: Port P6 Interrupt Detection Mode -->
        <register>
          <name>INT_MODE_P6</name>
          <description>Port P6 Interrupt Detection Mode</description>
          <addressOffset>0x01D8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 GPIO Interrupt Detection Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTFL_P0: Port P0 Interrupt Flags -->
        <register>
          <name>INTFL_P0</name>
          <description>Port P0 Interrupt Flags</description>
          <addressOffset>0x0200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P0.0 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin1</name>
              <description>P0.1 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin2</name>
              <description>P0.2 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin3</name>
              <description>P0.3 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin4</name>
              <description>P0.4 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin5</name>
              <description>P0.5 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin6</name>
              <description>P0.6 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin7</name>
              <description>P0.7 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- INTFL_P1: Port P1 Interrupt Flags -->
        <register>
          <name>INTFL_P1</name>
          <description>Port P1 Interrupt Flags</description>
          <addressOffset>0x0204</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P1.0 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin1</name>
              <description>P1.1 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin2</name>
              <description>P1.2 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin3</name>
              <description>P1.3 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin4</name>
              <description>P1.4 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin5</name>
              <description>P1.5 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin6</name>
              <description>P1.6 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pin7</name>
              <description>P1.7 External Interrupt Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

