tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- INTEN_P5: Port P5 Interrupt Enables -->
        <register>
          <name>INTEN_P5</name>
          <description>Port P5 Interrupt Enables</description>
          <addressOffset>0x0254</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P5.0 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P5.1 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P5.2 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P5.3 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P5.4 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P5.5 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P5.6 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P5.7 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTEN_P6: Port P6 Interrupt Enables -->
        <register>
          <name>INTEN_P6</name>
          <description>Port P6 Interrupt Enables</description>
          <addressOffset>0x0258</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 External Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- TMR:TMR0 -->

    <peripheral>
      <name>TMR0</name>
      <description>16/32 bit Timer/Counters</description>
      <groupName>Timers</groupName>
      <baseAddress>0x4000B000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR0</name>
        <value>22</value>
        <description>Timer 0 IRQ</description>
      </interrupt>
      <interrupt>
        <name>TMR16_0</name>
        <value>23</value>
        <description>16-bit Timer 0 IRQ</description>
      </interrupt>

      <registers>

        <!-- CTRL: Timer Control Register -->
        <register>
          <name>CTRL</name>
          <description>Timer Control Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mode</name>
              <description>Operating Modes for 32-bit/16-bit Timers</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tmr2x16</name>
              <description>Dual 16-bit Timer Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>prescale</name>
              <description>Timer Clock Prescale Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>polarity</name>
              <description>Timer I/O Polarity</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>enable0</name>
              <description>Enable 32-bit timer / 16-bit timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>enable1</name>
              <description>Enable 16-bit timer 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- COUNT32: [32 bit] Current Count Value -->
        <register>
          <name>COUNT32</name>
          <description>[32 bit] Current Count Value</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
        </register>

        <!-- TERM_CNT32: [32 bit] Terminal Count Setting -->
        <register>
          <name>TERM_CNT32</name>
          <description>[32 bit] Terminal Count Setting</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
        </register>

        <!-- PWM_CAP32: [32 bit] PWM Compare Setting or Capture/Measure Value -->
        <register>
          <name>PWM_CAP32</name>
          <description>[32 bit] PWM Compare Setting or Capture/Measure Value</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
        </register>

        <!-- COUNT16_0: [16 bit] Current Count Value, 16-bit Timer 0 -->
        <register>
          <name>COUNT16_0</name>
          <description>[16 bit] Current Count Value, 16-bit Timer 0</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>value</name>
              <description>Count Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TERM_CNT16_0: [16 bit] Terminal Count Setting, 16-bit Timer 0 -->
        <register>
          <name>TERM_CNT16_0</name>
          <description>[16 bit] Terminal Count Setting, 16-bit Timer 0</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>term_count</name>
              <description>Terminal Count Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

