tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- INTEN: Pulse Train Interrupt Enable/Disable -->
        <register>
          <name>INTEN</name>
          <description>Pulse Train Interrupt Enable/Disable</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pt0</name>
              <description>Pulse Train 0 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt1</name>
              <description>Pulse Train 1 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt2</name>
              <description>Pulse Train 2 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt3</name>
              <description>Pulse Train 3 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt4</name>
              <description>Pulse Train 4 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt5</name>
              <description>Pulse Train 5 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt6</name>
              <description>Pulse Train 6 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt7</name>
              <description>Pulse Train 7 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt8</name>
              <description>Pulse Train 8 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt9</name>
              <description>Pulse Train 9 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt10</name>
              <description>Pulse Train 10 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt11</name>
              <description>Pulse Train 11 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt12</name>
              <description>Pulse Train 12 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt13</name>
              <description>Pulse Train 13 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt14</name>
              <description>Pulse Train 14 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt15</name>
              <description>Pulse Train 15 Stopped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- PT:PT0 -->

    <peripheral>
      <name>PT0</name>
      <description>Pulse Train Generation</description>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011010</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000C</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- RATE_LENGTH: Pulse Train Configuration -->
        <register>
          <name>RATE_LENGTH</name>
          <description>Pulse Train Configuration</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>rate_control</name>
              <description>Pulse Train Enable/Rate Control</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mode</name>
              <description>Pulse Train Output Mode/Train Length</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32_BIT</name>
                  <description>Pulse train, 32 bit pattern.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SQUARE_WAVE</name>
                  <description>Square wave mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BIT</name>
                  <description>Pulse train, 2 bit pattern.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_BIT</name>
                  <description>Pulse train, 3 bit pattern.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_BIT</name>
                  <description>Pulse train, 4 bit pattern.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_BIT</name>
                  <description>Pulse train, 5 bit pattern.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_BIT</name>
                  <description>Pulse train, 6 bit pattern.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_BIT</name>
                  <description>Pulse train, 7 bit pattern.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>Pulse train, 8 bit pattern.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9_BIT</name>
                  <description>Pulse train, 9 bit pattern.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_BIT</name>
                  <description>Pulse train, 10 bit pattern.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11_BIT</name>
                  <description>Pulse train, 11 bit pattern.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_BIT</name>
                  <description>Pulse train, 12 bit pattern.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13_BIT</name>
                  <description>Pulse train, 13 bit pattern.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14_BIT</name>
                  <description>Pulse train, 14 bit pattern.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15_BIT</name>
                  <description>Pulse train, 15 bit pattern.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>Pulse train, 16 bit pattern.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17_BIT</name>
                  <description>Pulse train, 17 bit pattern.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18_BIT</name>
                  <description>Pulse train, 18 bit pattern.</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19_BIT</name>
                  <description>Pulse train, 19 bit pattern.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20_BIT</name>
                  <description>Pulse train, 20 bit pattern.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21_BIT</name>
                  <description>Pulse train, 21 bit pattern.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22_BIT</name>
                  <description>Pulse train, 22 bit pattern.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23_BIT</name>
                  <description>Pulse train, 23 bit pattern.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24_BIT</name>
                  <description>Pulse train, 24 bit pattern.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25_BIT</name>
                  <description>Pulse train, 25 bit pattern.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26_BIT</name>
                  <description>Pulse train, 26 bit pattern.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27_BIT</name>
                  <description>Pulse train, 27 bit pattern.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28_BIT</name>
                  <description>Pulse train, 28 bit pattern.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29_BIT</name>
                  <description>Pulse train, 29 bit pattern.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30_BIT</name>
                  <description>Pulse train, 30 bit pattern.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31_BIT</name>
                  <description>Pulse train, 31 bit pattern.</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TRAIN: Pulse Train Output Pattern -->
        <register>
          <name>TRAIN</name>
          <description>Pulse Train Output Pattern</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
        </register>

        <!-- LOOP: Pulse Train Loop Count -->
        <register>
          <name>LOOP</name>
          <description>Pulse Train Loop Count</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
        </register>

