tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
      </registers>
    </peripheral>


    <!-- PT:PT1 -->

    <peripheral derivedFrom="PT0">
      <name>PT1</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001101C</baseAddress>
    </peripheral>


    <!-- PT:PT2 -->

    <peripheral derivedFrom="PT0">
      <name>PT2</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011028</baseAddress>
    </peripheral>


    <!-- PT:PT3 -->

    <peripheral derivedFrom="PT0">
      <name>PT3</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011034</baseAddress>
    </peripheral>


    <!-- PT:PT4 -->

    <peripheral derivedFrom="PT0">
      <name>PT4</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011040</baseAddress>
    </peripheral>


    <!-- PT:PT5 -->

    <peripheral derivedFrom="PT0">
      <name>PT5</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001104C</baseAddress>
    </peripheral>


    <!-- PT:PT6 -->

    <peripheral derivedFrom="PT0">
      <name>PT6</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011058</baseAddress>
    </peripheral>


    <!-- PT:PT7 -->

    <peripheral derivedFrom="PT0">
      <name>PT7</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011064</baseAddress>
    </peripheral>


    <!-- PT:PT8 -->

    <peripheral derivedFrom="PT0">
      <name>PT8</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011070</baseAddress>
    </peripheral>


    <!-- PT:PT9 -->

    <peripheral derivedFrom="PT0">
      <name>PT9</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001107C</baseAddress>
    </peripheral>


    <!-- PT:PT10 -->

    <peripheral derivedFrom="PT0">
      <name>PT10</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011088</baseAddress>
    </peripheral>


    <!-- PT:PT11 -->

    <peripheral derivedFrom="PT0">
      <name>PT11</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011094</baseAddress>
    </peripheral>


    <!-- PT:PT12 -->

    <peripheral derivedFrom="PT0">
      <name>PT12</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110A0</baseAddress>
    </peripheral>


    <!-- PT:PT13 -->

    <peripheral derivedFrom="PT0">
      <name>PT13</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110AC</baseAddress>
    </peripheral>


    <!-- PT:PT14 -->

    <peripheral derivedFrom="PT0">
      <name>PT14</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110B8</baseAddress>
    </peripheral>


    <!-- PT:PT15 -->

    <peripheral derivedFrom="PT0">
      <name>PT15</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110C4</baseAddress>
    </peripheral>


    <!-- UART:UART0 -->

    <peripheral>
      <name>UART0</name>
      <description>UART / Serial Port Interface</description>
      <groupName>UARTs</groupName>
      <baseAddress>0x40012000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>34</value>
        <description>UART 0 IRQ</description>
      </interrupt>
      <registers>
        <!-- CTRL: UART Control Register -->
        <register>
          <name>CTRL</name>
          <description>UART Control Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>uart_en</name>
              <description>UART Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_en</name>
              <description>RX FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_en</name>
              <description>TX FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>data_size</name>
              <description>Data Size</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>extra_stop</name>
              <description>Extra Stop Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>parity</name>
              <description>Parity Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_en</name>
              <description>CTS Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_polarity</name>
              <description>CTS Polarity</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_en</name>
              <description>RTS Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_polarity</name>
              <description>RTS Polarity</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_level</name>
              <description>RX FIFO LTE Level for RTS Assert</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- BAUD: UART Baud Control Register -->
        <register>
          <name>BAUD</name>
          <description>UART Baud Control Register</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>baud_divisor</name>
              <description>Baud Divisor</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TX_FIFO_CTRL: UART TX Fifo Control Register -->
        <register>
          <name>TX_FIFO_CTRL</name>
          <description>UART TX Fifo Control Register</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fifo_entry</name>
              <description>TX FIFO Entries</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_ae_lvl</name>
              <description>TX FIFO AE Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RX_FIFO_CTRL: UART RX Fifo Control Register -->
        <register>
          <name>RX_FIFO_CTRL</name>
          <description>UART RX Fifo Control Register</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fifo_entry</name>
              <description>RX FIFO Entries</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_af_lvl</name>
              <description>RX FIFO AF Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- MD_CTRL: UART Multidrop Control Register -->
        <register>
          <name>MD_CTRL</name>
          <description>UART Multidrop Control Register</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>slave_addr</name>
              <description>Slave Address</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>slave_addr_msk</name>
              <description>Slave Address Mask</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>md_mstr</name>
              <description>Multidrop Master</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_addr_mark</name>
              <description>RX Address Mark</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

