tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- LIMIT1: ADC Limit 1 -->
        <register>
          <name>LIMIT1</name>
          <description>ADC Limit 1</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ch_lo_limit</name>
              <description>Low Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit</name>
              <description>High Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_lo_limit_en</name>
              <description>Low Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit_en</name>
              <description>High Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- LIMIT2: ADC Limit 2 -->
        <register>
          <name>LIMIT2</name>
          <description>ADC Limit 2</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ch_lo_limit</name>
              <description>Low Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit</name>
              <description>High Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_lo_limit_en</name>
              <description>Low Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit_en</name>
              <description>High Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- LIMIT3: ADC Limit 3 -->
        <register>
          <name>LIMIT3</name>
          <description>ADC Limit 3</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ch_lo_limit</name>
              <description>Low Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit</name>
              <description>High Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_lo_limit_en</name>
              <description>Low Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit_en</name>
              <description>High Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- AFE_CTRL: AFE Control Register -->
        <register>
          <name>AFE_CTRL</name>
          <description>AFE Control Register</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tmon_intbias_en</name>
              <description>Enable internal temperature measurement bias generator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tmon_extbias_en</name>
              <description>Enable external temperature measurement bias generator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RO_CAL0: RO Trim Calibration Register 0 -->
        <register>
          <name>RO_CAL0</name>
          <description>RO Trim Calibration Register 0</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ro_cal_en</name>
              <description>RO Calibration Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ro_cal_run</name>
              <description>RO Calibration Run</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ro_cal_load</name>
              <description>RO Calibration Load Initial Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ro_cal_atomic</name>
              <description>RO Calibration Run Atomic</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trm_mu</name>
              <description>RO Trim Adaptation Gain</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ro_trm</name>
              <description>RO Trim Calibration Result</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

