tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/max32620.svd
        <!-- RO_CAL1: RO Trim Calibration Register 1 -->
        <register>
          <name>RO_CAL1</name>
          <description>RO Trim Calibration Register 1</description>
          <addressOffset>0x0028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>trm_init</name>
              <description>RO Trim Initial Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trm_min</name>
              <description>RO Trim Maximum Adaptive Limit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trm_max</name>
              <description>RO Trim Minimum Adaptive Limit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RO_CAL2: RO Trim Calibration Register 2 -->
        <register>
          <name>RO_CAL2</name>
          <description>RO Trim Calibration Register 2</description>
          <addressOffset>0x002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>auto_cal_done_cnt</name>
              <description>Auto Cal Time Delay for Atomic Calibration (in milliseconds)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
